START_TEXT = 'Нам очень приятно, что Вы проявили интерес к нашей компании и работе в кружке робототехники!\n\n' \
             'Алексей Кремлёв расскажет о нашей компании, её структуре и ценностях. Почему мы не такие как все, и как ' \
            'мы к этому пришли.\n\n' 'Жми ссылку и знакомься с Миром Умной Механики. "https://rutube.ru/plst/585340/"\n\n'\
            'Остались вопросы? Тогда пиши представителю метод команды https://t.me/EkaterinaPti4kina.\n\n' \
            'Нет вопросов? Тогда можем перейти к стажировке.\n Нажмите трудоустройство'

LESSON1_TEXT = 'Пора ознакомиться с документами, которые необходимы для работы.\n\n' \
               'Руководство для педагогов Федеральной сети технологических кружков "Умная Механика" содержит полное ' \
               'описание доступных вам ресурсов, услуг и руководящих положений.\n\n'\
                'Остались вопросы? Напиши https://t.me/EkaterinaPti4kina\n\n' \
                'Нет вопросов? Можно двигаться дальше.\nНажмите /lesson2'

LESSON2_TEXT =  'Теперь пришло время пройти Школу педагогов и наставников Умной Механики. Что это такое и что тебя ' \
                 'ждёт? ' 'Ответ есть!\n\n' 'Школа педагогов это образовательный интенсив на котором ты узнаешь как ' \
                 'проводятся занятия в Умной Механике, ' 'какие курсы можно преподавать, как держать детей под '\
                 'контролем, а родителей водить строем!\n\n' 'Жми ссылку "https://rutube.ru/plst/518420/"\n\n' \
                 'Остались вопросы? Как и прежде https://t.me/EkaterinaPti4kina ждёт сообщения и грустит, если никто '\
                 'не пишет.\n\n' 'Нет вопросов? Будем двигаться дальше!\nЖми /lesson3'

LESSON3_TEXT = 'Теперь пора перейти от поверхностного изучения к более углубленному и выполнить небольшой курс '\
                 'домашних ' 'заданий, который поможет на практике ориентироваться в конструкторе и среде '\
                 'программирования, а также понять ' 'в каких темах стоит подтянуть знания.\n\n' 'Нажми на ссылку '\
                 'чтобы получить домашку '\
                 '"https://drive.google.com/drive/u/1/folders/1XvOK6emqpQJUGdzCqN9mYsiZ4N6OwNCS"\n\n' 'А если не '\
                 'терпится приступить к работе, вступай в чат УМные педагоги "https://t.me/+sI7XVk1UiKU0N2Zi" и пиши '\
                 'в тему ' 'своего города «Хочу на стажировку»!'


questions = [
    "1/6 \nРасскажи про опыт взаимодействия с младшими школьниками?",
    "2/6 \nЕсть ли опыт в робототехнике? (если есть, напиши какой именно)",
    "3/6 \nкаком районе или каких соседних городах ты бы мог работать?",
    "4/6 \nСвободное время для работы?",
    "5/6 \nРасскажи нам, что у тебя получается лучше всего",
    "6/6 \nЗапиши видеокружок с объяснениями алгоритма для первоклассника"
]


SCRATCH_LESSON_TEXT = (
    "А теперь ознакомься с презентацией по Scratch и повтори занятие в ней:\n\n"
    "Ссылка на презентацию:\n"
    "https://docs.yandex.ru/docs/view?url=ya-disk-public%3A%2F%2Fzo61aioJ7xoqxECwET%2B%2BAcbsYLeq%2BgsuHpO4Aoxv43QExnvVokk5cqHXVpUF4Bgcq%2FJ6bpmRyOJonT3VoXnDag%3D%3D%3A%2F1.pptx&name=1.pptx\n\n"
    "и пришли кружок работоспособности программы по презентации\n\n"
    "(нам пришел сигнал, что прислал кружок)\n\n"
    "Остались вопросы? Тогда пиши представителю метод команды https://t.me/EkaterinaPti4kina."
)


ROBO_KIT_TEXT = (
    "А теперь, чтобы мы могли тебе выслать набор для подготовки к занятиям по робототехнике, "
    "напиши адрес (вместе с городом) ближайшего пункта выдачи OZON и справку о несудимости "
    "(сообщи и закажи, если её нет). И чуть позже с Вами свяжется наш коллега, чтобы уточнить детали.\n\n"
    "Остались вопросы? Тогда пиши представителю метод команды https://t.me/EkaterinaPti4kina.\n\n"
    "Жми команду /lesson4"
)